In [6]:
import pandas as pd
data=[['aish',40],['ravi'],['manu',80],['beena']]
df=pd.DataFrame(data,columns=['NAME','MARK'])
print(df)
print("\nAFTER MODIFICATION\n")
df1=df.fillna(0)
df1

    NAME  MARK
0   aish  40.0
1   ravi   NaN
2   manu  80.0
3  beena   NaN

AFTER MODIFICATION

    NAME  MARK
0   aish  40.0
1   ravi   0.0
2   manu  80.0
3  beena   0.0